{
    "channelID": "960522831374975017",
    "messages": [
        {
            "id": "1019494961709846548",
            "content": [
                "**Vítáme Tě na oficiálním discord serveru Katedry informatiky UP. **",
                "Dříve, než začneš na serveru fungovat, jdi do místnosti <channel>firewall</channel>, kde podle návodu ověříš svůj účet. Bez tohoto kroku ti nebudou zpřístupněny žádné funkce. Poté navštiv místnost <channel>role</channel> a podle návodu si nastav role tak, aby se ti zpřístupnily ostatní funkce. Pro studenty je určena místnost <channel>výběr-předmětů</channel>, kde si zvolí své předměty, které zobrazí místnosti k předmětům. Server máme rozdělen na několik kategorií."
            ]
        },
        {
            "id": "1019494981003653173",
            "content": [
                "⠀",
                "⠀",
                "**SERVER**",
                "> V této kategorii najdeš veškeré základní informace ohledně fungování serveru. Rovněž si tu můžeš vybrat role, které ti zpřístupní další funkce.",
                "",
                "**INFORMAČNÍ TABULE**",
                "> Místnosti s aktualitami, novinkami a různými aktivitami spojenými s katedrou. Nejdůležitější místnosti zde jsou <channel>aktuality-a-oznámení</channel> a místnost <channel>akce-soutěže</channel>, kde můžeš zjistit, co se kde zrovna děje a co probíhá.",
                "",
                "**GENERAL**",
                "> Hlavní kategorie serveru. Najdeš zde zejména <channel>general</channel> (hlavní chat), nebo například <channel>off-topic</channel>. Nezapomeň nám zanechat zpětnou vazbu v <channel>faq-a-feedback</channel>, případně můžeš přidat nějaké <channel>citáty</channel> vyučujících.",
                "",
                "**ZÁBAVA**",
                "> Máš galerii plnou memes? Chceš si pokecat o gamingu, doporučit film, udělat si dobrý playlist, nebo prostě jen zajít na pivo? Tato kategorie je pro tebe!",
                "",
                "**TECHNOLOGIE**",
                "> Diskuzní místnosti související s technologií. Pokud máš nějaký technický dotaz nebo zajímavost, piš to sem. Dotazy přímo ke konkrétnímu předmětům piš do místnosti pro daný předmět, kterou najdeš v kategoriích ZIMNÍ/LETNÍ SEMESTR a PROGRAMOVACÍ JAZYKY níže.",
                "",
                "**STUDIUM**",
                "> Tady najdeš věci týkající se studia, zejména potom kanál <channel>poradna</channel>, kde se můžeš ptát na vše související se studiem na univerzitě.",
                "",
                "**PROGRAMOVACÍ JAZYKY, ZIMNÍ SEMESTR, LETNÍ SEMESTR**",
                "> Do těchto místností mají přístup __pouze studenti__. Veškeré informace k těmto kategoriím najdeš v místnosti <channel>role</channel> a <channel>výběr-předmětů</channel>.",
                "",
                "**BOT**",
                "> Samostatná kategorie pro našeho bota."
            ]
        },
        {
            "id": "1019495000641372190",
            "content": [
                "⠀",
                "**Pravidla**",
                "1. Zákaz nesmyslného tagování rolí.",
                "2. Není dovoleno šířit jakékoliv fake news a nepodložené informace.",
                "3. Zákaz sexuálního, explicitního a NSFW obsahu, diskriminace ostatních ras, pohlaví, náboženství nebo sexuální orientace.",
                "4. Zákaz ofenzivních jmen a avatarů.",
                "5. Neurážejte a neznevažujte ostatní.",
                "7. Používejte místnosti pro jejich daný účel.",
                "8. Nesdílejte irelevantní promo, scamy, nelegální odkazy apod.",
                "9. Nikdo nezodpovídá za informace, které tu dostanete.",
                "10. Žádné spamování příkazů.",
                "11. Zákaz zneužívání botů a zvaní chat botů.",
                "12. Pokud si všimnete jakéhokoliv porušení pravidel informuj jednoho z našich <role>Moderátor</role> nebo <role>Root</role>.",
                "",
                "Spolu s těmito pravidly také souhlasíte s pravidly Discordu, které naleznete na discord.com.",
                "**Neznalost pravidel se neomlouvá.**"
            ]
        },
        {
            "id": "1019495022049103872",
            "content": [
                "⠀",
                "**Tipy a příkazy**",
                "",
                "**Tipy**",
                " - Při vstupu do místnosti se doporučujeme podívat na informace o místnosti (téma kanálu), abyste věděli, jak s místností pracovat. Na desktopu je najdete na horní liště vedle názvu kanálu. Na mobilu v pravém sidebaru.",
                " - Než se na něco zeptáte, doporučujeme se podívat do připnutých zpráv, zda už se téma v minulosti už neřešilo.",
                "",
                "**Příkazy**",
                " - Pomocí příkazu **/everyrequest popisek** můžete poslat žádost o ping everyone. Prosíme popište podrobně svoji žádost a odešlete. Žádost bude následně zpracována a následně schválena našimi <role>Moderátor</role>.",
                " - Pomocí příkazu **/citát popisek** můžete poslat žádost o přidání citátu do místnosti <channel>citáty</channel>. Prosíme posílejte citáty ve formátu: \"Text citátu. - Jméno učitele \". Citát bude následně zpracován a následně schválen našimi <role>Moderátor</role>.",
                "",
                "Doufáme, že na serveru najdeš všechny potřebné informace a taky skvělou komunitu studentů. V případě jakýchkoliv dotazů, napiš do <channel>dotazy</channel>.",
                "",
                "**Pozvánka na server, kterou doporučujeme používat:**",
                "https://discord.gg/zHqmCzPMEW",
                "",
                "**Základní příručka pro Discord:**",
                "https://support.discord.com/hc/en-us/articles/360045138571-Beginner-s-Guide-to-Discord",
                "Co to jsou vlákna a jak fungují?",
                "https://support.discord.com/hc/en-us/articles/4403205878423-Threads-FAQ",
                "Jak vypnu notifikace konkrétní místnosti?",
                "https://support.discord.com/hc/en-us/articles/209791877-How-do-I-mute-and-disable-notifications-for-specific-channels-",
                "",
                "**Enjoy!**"
            ]
        }
    ]
}
