{
    "channelID": "960522831374975017",
    "messages": [
        {
            "id": "1019494961709846548",
            "content": [
                "**Vítáme Tě na oficiálním discord serveru Katedry informatiky UP. **",
                "Dříve, než začneš na serveru fungovat, jdi do místnosti <channel>firewall</channel>, kde podle návodu ověříš svůj účet. Bez, tohoto kroku ti nebudou zpřístupněny žádné funkce. Poté navštiv místnost <channel>role</channel> a podle návodu si nastav role tak, aby se ti zpřístupnili ostatní funkce. Pro studenty je určena místnost <channel>výběr-předmětů</channel> kde si zvolí své předměty, které zobrazí místnosti k předmětům. Server máme rozdělen na několik kategorií."
            ]
        },
        {
            "id": "1019494981003653173",
            "content": [
                "⠀",
                "⠀",
                "**SERVER**",
                " - V této kategorii najdeš veškeré základní informace ohledně fungování serveru. Nejdůležitější místnosti zde jsou <channel>oznámení-a-novinky</channel>a místnost <channel>návrhy-a-připomínky</channel>, která slouží jako zpětná vazba pro vylepšení serveru.",
                "",
                "**GENERAL**",
                " - Hlavní kategorie serveru. Najdeš zde #general (hlavní chat), <channel>memes</channel>, <channel>dotazy</channel> k fungování discordu a serveru, <channel>citáty</channel> učitelů.",
                "",
                "**INFORMAČNÍ TABULE**",
                " - Místnosti s aktualitami, novinkami a různými aktivitami spojenými s katedrou.",
                "",
                "**KATEDRA**",
                " - Soukromá kategorie pro doktorandy a zaměstnance katedry.",
                "",
                "**HLASOVÉ KANÁLY**",
                " - Hlasové místnosti pro hlasovou komunikaci s tvými kamarády.",
                "",
                "**STUDIUM**",
                " - Tady najdeš veškeré věci týkající se studia, dále místnosti pro bakalářské a diplomové práce, <channel>rozvrhy</channel> pro dotazy k rozvrhům a výměně předmětů s ostatními studenty.",
                "",
                "**TECHNOLOGIE**",
                " - Diskuzní místnosti týkajících daných technologií. Pokud máš nějaký technický dotaz nebo zajímavost, piš sem. Dotazy přímo ke konkrétnímu předmětům piš do místnosti pro daný předmět, který patří do kategoríí ZIMNÍ/LETNÍ SEMESTR nebo PROGRAMOVACÍ JAZYKY.",
                "",
                "**ZÁBAVA**",
                " - Chceš si pokecat o gamingu, doporučit film, udělat si promo, nebo prostě jen zajít na pivo? Tato kategorie je pro tebe!",
                "",
                "**BOT**",
                " - Kategorie pro našeho bota.",
                "",
                "**PROGRAMOVACÍ JAZYKY, ZIMNÍ SEMESTR, LETNÍ SEMESTR**",
                " - Do těchto místností mají přístup pouze student. Podrobné informace k těmto kategoriím najdeš v místnosti <channel>role</channel>."
            ]
        },
        {
            "id": "1019495000641372190",
            "content": [
                "⠀",
                "**Pravidla**",
                "1. Zákaz nesmyslného tagování rolí. ",
                "2. Není povoleno jakékoliv fake news.",
                "3. Zákaz sexuálního, explicitního a NSFW obsahu, diskriminace ostatních ras, pohlaví, náboženství nebo sexuální orientace.",
                "4. Zákaz ofenzivní jmen a avatarů.",
                "5. Neurážejte se, neznevažujte ostatní, nenadávejte ostatním.",
                "7. Používejte roomky pro jejich daný účel. ",
                "8. Nesdílejte irrelevantní promo, scamy, nelegální odkazy apod.",
                "9. Nikdo nezodpovídá za informace, které tu dostanete.",
                "10. Žádné spamování příkazů.",
                "11. Zákaz zneužívání botů.",
                "12. Pokud si všimnete jakéhokoliv porušení pravidel informuj jednoho z našich <role>Moderátor</role> nebo <role>Root</role>.",
                "",
                "Spolu s těmito pravidly také souhlasíte s pravidly discordu, které naleznete na discord.com.",
                "**Neznalost pravidel se neomlouvá.**"
            ]
        },
        {
            "id": "1019495022049103872",
            "content": [
                "⠀",
                "**Tipy a příkazy**",
                "",
                "**Tipy**",
                " - Při vstupu do místnosti se doporučujeme podívat na informace o místnosti (téma kanálu), aby jste věděli jak s místností pracovat. Na desktop je najdete na horní liště vedle názvu kanálu. Na mobilu v pravém sidebaru.",
                " - Než se na něco zeptáte, doporučujeme se podívat do připnutých zpráv, jestli se daný dotaz již nevyskytnul.",
                "",
                "**Příkazy**",
                " - Pomocí příkazu **/everyrequest popisek** můžete poslat žádost o everyone. Prosíme popište podrobně svoji žádost a odešlete. Žádost bude následně zpracována a následně schválena našimi <role>Moderátor</role>.",
                " - Pomocí příkazu **/citát popisek** můžete poslat žádost o přidání citátu do místnosti <channel>citáty</channel>. Prosíme posílejte citáty ve formátu: \"Text citátu. - Jméno učitele \". Citát bude následně zpracován a následně schválen našimi <role>Moderátor</role>.",
                "",
                "Doufáme, že na serveru najdeš všechny potřebné informace a taky skvělou komunitu studentů. V případě jakýchkoliv dotazů, napiš do <channel>dotazy</channel>.",
                "",
                "**Základní příručka pro Discord:**",
                "https://support.discord.com/hc/en-us/articles/360045138571-Beginner-s-Guide-to-Discord",
                "Co to jsou vlákna a jak fungují?",
                "https://support.discord.com/hc/en-us/articles/4403205878423-Threads-FAQ",
                "Jak vypnu notifikace konkrétní místnosti?",
                "https://support.discord.com/hc/en-us/articles/209791877-How-do-I-mute-and-disable-notifications-for-specific-channels-",
                "",
                "**Enjoy!**"
            ]
        }
    ]
}